name_user = input("Привіт, я твій бот помічник, ми зіграємо в гру <Питання-відповідь> як до тебе звертатися? ")
print (f"Приємно чути {name_user}")
print ("Також хотів сказати тобі що гра має 7 запитань, і якщо ти даш не вірну відповідь хочаб на одне запитання то ти програєш!")

while True:
    start_game = input("Ну що почнімо?(Так або Ні...) ")
    if start_game == ("Так"):
        print("Тоді поїхали!")
        answer_1 = input("Скільки материків на землі? ")
        if answer_1 == ("6"):
            print("Молодець!")
        else:
            print("Невірно, ти програв😕")
            break
        answer_2 = input("Яка столиця України? ")
        if answer_2 == ("Київ"):
            print("Так тримати!")
        else:
            print("Невірно, ти програв😕")
            break
        answer_3 = input("Яка найбільша планета в Сонячній системі? ")
        if answer_3 == ("Юпітер"):
            print("Добре!")
        else:
            print("Невірно, ти програв😕")
            break
        answer_4 = input("Скільки днів у тижні? ")
        if answer_4 == ("7"):
            print("Ти розумник!")
        else:
            print("Невірно, ти програв😕")
            break
        answer_5 = input("Скільки літер в українському алфавіті ")
        if answer_5 == ("33"):
            print("Добре!")
        else:
            print("Невірно, ти програв😕")
            break
        answer_6 = input("В якому році почалась друга світова війна? ")
        if answer_6 == ("1939"):
            print("Ти розумник!")
        else:
            print("Невірно, ти програв😕")
            break
        answer_7 = input("Ну і нарешті кінцеве питання, скільки пальців на правій руці у людини? ")
        if answer_7 == ("5"):
            print("Молодець, ти дав відповідь на всі запитання. Ти виграв😎")
            break
        else:
            print("Невірно, ти програв😕")
            break

    elif start_game == ("Ні"):
        print("Я чекатиму тебе! До зустрічі!")
        break
    else: print("Мабуть ти некоректно увів свою відповідь, будь ласка уведи її заново")
